Use mermaid in README
